app/controllers/listings_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def index
        # @listings = Listing.where(creator_id:params[:user_id])          # this query also works
        @user = User.find(params[:user_id])

INSERT INTO "listings" ("title", "description", "product", "location", "length", "creator_id", "created_at", "updated_at", "available_from", "available_until") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        @listing = Listing.new(listing_params)
        if @listing.save                            # if successfully saves

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def show
        @listing = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
    def edit
        @listing = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
UPDATE "listings" SET "title" = $1, "product" = $2, "available_from" = $3, "available_until" = $4, "updated_at" = $5 WHERE "listings"."id" = $6  [["title", "rickie fowler"], ["product", "coil tubing"], ["available_from", "2021-04-09"], ["available_until", "2021-04-16"], ["updated_at", "2021-04-08 17:51:23.107320"], ["id", 59]]
---
    def update
        @listing = Listing.find(params[:id])
        if @listing.update(listing_params)                              # if successfully updates

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 64]]
---
    def destroy
        @listing = Listing.find(params[:id])
        @listing.destroy

SELECT "listings".* FROM "listings"
---
    def main_page
        @listings = Listing.all